
////////////////////////////////////////////////////////////////
typedef struct  //hp info struct
{
    int fileDesc; /* αναγνωριστικός αριθμός ανοίγματος αρχείου από το επίπεδο block */
    char attrType; /* ο τύπος του πεδίου που είναι κλειδί για το συγκεκριμένο αρχείο, 'c' ή'i' */ 
    char* attrName; /* το όνομα του πεδίου που είναι κλειδί για το συγκεκριμένο αρχείο */
    int attrLength; /* το μέγεθος του πεδίου που είναι κλειδί για το συγκεκριμένο αρχείο */
} HP_info;
////////////////////////////////////////////////////////////////
typedef struct  //record struct
{
    int id;
    char name[15];
    char surname[25];
    char address[50];
} Record;
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
int HP_CreateFile(
    char *fileName, /* όνοµα αρχείου */
    char attrType, /* τύπος πεδίου-κλειδιού: 'c', 'i' */
    char* attrName, /* όνοµα πεδίου-κλειδιού */
    int attrLength /* µήκος πεδίου-κλειδιού */);
////////////////////////////////////////////////////////////////
HP_info* HP_OpenFile(
    char *fileName /* όνοµα αρχείου */ );
////////////////////////////////////////////////////////////////
int HP_CloseFile(
    HP_info* header_info );
////////////////////////////////////////////////////////////////
int HP_InsertEntry(
    HP_info header_info, /* επικεφαλίδα του αρχείου*/
    Record record /* δοµή που προσδιορίζει την εγγραφή */ );
////////////////////////////////////////////////////////////////
int HP_DeleteEntry( 
    HP_info header_info, /* επικεφαλίδα του αρχείου*/
    void *value /* τιµή του πεδίου-κλειδιού προς διαγραφή */);
////////////////////////////////////////////////////////////////
int HP_GetAllEntries(
    HP_info header_info, /* επικεφαλίδα του αρχείου */
    void *value /* τιµή του πεδίου-κλειδιού προς αναζήτηση */);
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
