#include "HT.h"
////////////////////////////////////////////////////////////////
typedef struct {
    int fileDesc; /* αναγνωριστικός αριθµός ανοίγµατος αρχείου από το επίπεδο block */
    char* attrName; /* το όνοµα του πεδίου που είναι κλειδί για το συγκεκριµένο αρχείο */
    int attrLength; /* το µέγεθος του πεδίου που είναι κλειδί για το συγκεκριµένο αρχείο */
    long int numBuckets; /* το πλήθος των “κάδων” του αρχείου κατακερµατισµού */
    char *fileName; /* όνοµα αρχείου µε το πρωτεύον ευρετήριο στο id */
} SHT_info;
////////////////////////////////////////////////////////////////
typedef struct{
    Record record;
    int blockId; //Το block στο οποίο έγινε η εισαγωγή της εγγραφής στο πρωτεύον ευρετήριο.
} SecondaryRecord;
////////////////////////////////////////////////////////////////
////////////////////////////////////////////////////////////////
int SHT_CreateSecondaryIndex(
    char *sfileName, /* όνοµα αρχείου */
    char* attrName, /* όνοµα πεδίου-κλειδιού */
    int attrLength, /* µήκος πεδίου-κλειδιού */
    int buckets, /* αριθµός κάδων κατακερµατισµού*/
    char* fileName /* όνοµα αρχείου πρωτεύοντος ευρετηρίου*/);
////////////////////////////////////////////////////////////////
SHT_info* SHT_OpenSecondaryIndex(
    char *sfileName /* όνοµα αρχείου */);
////////////////////////////////////////////////////////////////
int SHT_CloseSecondaryIndex(
    SHT_info* header_info);
////////////////////////////////////////////////////////////////
int SHT_SecondaryInsertEntry(
    SHT_info header_info, /* επικεφαλίδα του αρχείου*/
    SecondaryRecord record /* δοµή που προσδιορίζει την εγγραφή */);
////////////////////////////////////////////////////////////////
int SHT_SecondaryGetAllEntries(
    SHT_info header_info_sht, /* επικεφαλίδα του αρχείου δευτερεύοντος ευρετηρίου*/
    HT_info header_info_ht, /* επικεφαλίδα του αρχείου πρωτεύοντος ευρετηρίου*/
    void *value /* τιµή του πεδίου-κλειδιού προς αναζήτηση */);
////////////////////////////////////////////////////////////////
int HashStatistics(
    char* filename /* όνοµα του αρχείου που ενδιαφέρει */ );
////////////////////////////////////////////////////////////////